---
kind: other
id: Properties.T:Autodesk.Revit.DB.Mechanical.DuctPressureDropData
source: html/717e198d-7f26-0f63-2c93-2a630f4c1013.htm
---
# DuctPressureDropData Properties

The category id of duct curves. It will be OST_DuctCurves, OST_FlexDuctCurves, or OST_PlaceHolderDucts.